---
kind: property
id: P:Autodesk.Revit.DB.FilterOperatorAndTextString.OperatorType
source: html/3e2129fb-770f-be50-b551-eef05f1b5d43.htm
---
# Autodesk.Revit.DB.FilterOperatorAndTextString.OperatorType Property

The filter operator.

## Syntax (C#)
```csharp
public ScheduleFilterType OperatorType { get; }
```